{
  "version": "1.0",
  "lastUpdated": "2025-09-19T17:37:16.171Z",
  "recipeCount": 1,
  "recipes": [
    {
      "url": "https://natashaskitchen.com/wprm_print/creamy-cajun-chicken-pasta",
      "title": "Creamy Cajun Chicken Pasta",
      "servings": 4,
      "prepTime": 15,
      "cookTime": 30,
      "ingredients": [
        {
          "amount": "8",
          "unit": "oz",
          "item": "linguine pasta"
        },
        {
          "amount": "2",
          "unit": "boneless",
          "item": "skinless chicken breasts"
        },
        {
          "amount": "2",
          "unit": "tsp",
          "item": "olive oil"
        },
        {
          "amount": "2",
          "unit": "Tbsp",
          "item": "unsalted butter"
        },
        {
          "amount": "1",
          "unit": "",
          "item": "1/2 to 2 Tbsp cajun seasoning, divided, (or added to taste depending on the brand you use*)"
        },
        {
          "amount": "3",
          "unit": "garlic",
          "item": "cloves, minced"
        },
        {
          "amount": "2/3",
          "unit": "cup",
          "item": "diced tomatoes"
        },
        {
          "amount": "1",
          "unit": "",
          "item": "1/2 cup heavy whipping cream"
        },
        {
          "amount": "1/2",
          "unit": "cup",
          "item": "grated parmesan cheese"
        },
        {
          "amount": "2",
          "unit": "Tbsp",
          "item": "parsley, finely chopped, to serve"
        }
      ],
      "steps": [
        "InstructionsBring a large pot of water to a boil and add 1 Tbsp salt. Cook pasta according to package instructions until al dente. Reserve 1/2 cup of pasta water then drain, cover, and keep warm.",
        "Beat the chicken breasts so that they are even in thickness and season all over with 1½ Tbsp cajun seasoning.",
        "In a large non-reactive skillet*, heat 2 tsp oil over medium-high heat. Once hot, add the chicken and sear on both sides.  Turn heat down to low and saute until cooked through and 165˚F on a thermometer. Transfer to a cutting board, slice into thin strips, and cover to keep warm.",
        "In the same skillet over medium heat, saute the butter and garlic for 30-60 seconds or until the garlic is fragrant. Add the diced tomatoes and saute another 2 minutes.",
        "Add in the heavy whipping cream, add remaining cajun seasoning to taste, and parmesan cheese, and bring to a simmer. Season to taste if needed.",
        "Add the sliced chicken and cooked pasta to the sauce and toss until combined and pasta and chicken are warmed through. Add warm reserved pasta water if desired to thin the sauce. Serve with freshly grated parmesan and chopped parsley."
      ],
      "imageUrl": null,
      "dateAdded": "2025-09-19T17:37:16.170Z"
    }
  ]
}